#вводится трехзначное число. Проверить истинность высказывания "Цифры данного числа образуют возрастающую последовательность"
#вводим число
n = input("Введите трехзначное число: ")
#обработчик исключений
while type(n)!=int():
        try:
            #присваю каждой цифре числа переменную
            a = int(n[0])
            b = int(n[1])
            c = int(n[2])
            # проверка на соответветсвие
            if a < b < c:
                print("Цифры данного числа образуют возрастающую последовательность")
                break
            else:
                print("Цифры данного числа не образуют возрастающую последовательность")
                break
        except ValueError:
            print('неправильно ввели')
            n= input('Введите трехзначное число:')