import sqlite3

avtori = [
    (1, "Толстой", "Лев"),
    (2, "Пушкин", "Александр"),
    (3, "Дефо", "Даниэль"),
    (4, "Булгаков", "Михаил"),
    (5, "Карнеги", "Дейл"),
    (6, "Джейн", "Шемилт"),
    (7, "Дюма", "Александр"),
    (8, "Чехов", "Антон"),
    (9, "Горький", "Максим"),
    (10, "Лермонтов", "Михаил"),
    (11, "Петров","Александр"),
    (12,"Иванов","Николай"),
    (13,"Тузюк","Анна")
    ]
with sqlite3.connect('Библиотека.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO Авторы VALUES(?, ?, ?)", avtori)



razdeli = [
    ("Классика",),
    ("Классика",),
    ("Классика",),
    ("Классика",),
    ("Психология",),
    ("Детектив",),
    ("Классика",),
    ("Классика",),
    ("Классика",),
    ("Классика",),
    ("Фантастика",),
    ("Фантастика",),
    ("Научная",)
    ]
with sqlite3.connect('Библиотека.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO Разделы VALUES(?)", razdeli)

izdatelstva = [
    ("O'Reilly media", "Санкт-петербург"),
    ("Эксмо", "Москва"),
    ("Вече", "Москва"),
    ("Эксмо", "Москва"),
    ("O'Reilly media", "Санкт-петербург"),
    ("Вече", "Москва"),
    ("Вече", "Санкт-петербург"),
    ("Коловрат", "Москва"),
    ("Коловрат", "Москва"),
    ("O'Reilly media", "Санкт-петербург"),
    ("Эксмо","Москва"),
    ("O'Reilly media","Санкт-петербург"),
    ("Эксмо","Москва")
    ]
with sqlite3.connect('Библиотека.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO Издательства VALUES(?,?)", izdatelstva)

avtorKnigi = [
    (),
    (),
    (),
    (),
    (),
    (),
    (),
    (),
    (),
    (),
    (),
    (),
    ()
    ]
with sqlite3.connect('Библиотека.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO АвторКниги VALUES(?,?,?)", avtorKnigi)





